#Выведите число π с заданной точностью. Точность выводится в виде десятичной дроби.
import math
print(round(math.pi, 2))